<!-- dflook/terraform-github-actions {"workspace":"production","backend_type":"remote","label":"Production","backend":"e175130bff20f3dada56826bab8a78ea13bf0fa2e46e7efab9f5306051351ac7","plan_job_ref":"Job Terraform Plan #21 at https://github.com/LancelotP/toolbox/actions/runs/15836849814","plan_out_hash":"678b46a5f854dea7f816d124b9447c5922dbbb3a6ffda9f580c0e1dcad059421","plan_hash":"134f8dd3a2ed9389c78f5276aa536edf914c28934a8b4b7b6517ea7f7bac4e1c","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan for __Production__
<details>
<summary>Plan: 5 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # module.github_env.github_actions_environment_secret.registry_token will be destroyed
  # (because github_actions_environment_secret.registry_token is not in configuration)
-   resource "github_actions_environment_secret" "registry_token" {
-       created_at      = "2025-06-23 15:38:05 +0000 UTC" -> null
-       environment     = "production" -> null
-       id              = "toolbox:production:SCW_REGISTRY_TOKEN" -> null
-       plaintext_value = (sensitive value) -> null
-       repository      = (sensitive value) -> null
-       secret_name     = "SCW_REGISTRY_TOKEN" -> null
-       updated_at      = "2025-06-23 15:38:05 +0000 UTC" -> null
#        (1 unchanged attribute hidden)
    }

  # module.github_env.github_actions_environment_secret.scw_access_key will be created
+   resource "github_actions_environment_secret" "scw_access_key" {
+       created_at      = (known after apply)
+       environment     = "production"
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = (sensitive value)
+       secret_name     = "SCW_ACCESS_KEY"
+       updated_at      = (known after apply)
    }

  # module.github_env.github_actions_environment_variable.api_container_id will be created
+   resource "github_actions_environment_variable" "api_container_id" {
+       created_at    = (known after apply)
+       environment   = "production"
+       id            = (known after apply)
+       repository    = (sensitive value)
+       updated_at    = (known after apply)
+       value         = (known after apply)
+       variable_name = "SCW_API_CONTAINER_ID"
    }

  # module.github_env.github_actions_environment_variable.scw_organization_id will be created
+   resource "github_actions_environment_variable" "scw_organization_id" {
+       created_at    = (known after apply)
+       environment   = "production"
+       id            = (known after apply)
+       repository    = (sensitive value)
+       updated_at    = (known after apply)
+       value         = "8ae5bb3f-d8df-48fe-adce-7b438abfeceb"
+       variable_name = "SCW_ORGANIZATION_ID"
    }

  # module.github_env.github_actions_environment_variable.scw_project_id will be created
+   resource "github_actions_environment_variable" "scw_project_id" {
+       created_at    = (known after apply)
+       environment   = "production"
+       id            = (known after apply)
+       repository    = (sensitive value)
+       updated_at    = (known after apply)
+       value         = "406ee172-bb08-443e-9c03-99dbda959054"
+       variable_name = "SCW_PROJECT_ID"
    }

  # module.github_env.github_repository_environment.environment will be updated in-place
!~  resource "github_repository_environment" "environment" {
        id                  = "toolbox:production"
#        (5 unchanged attributes hidden)

-       deployment_branch_policy {
-           custom_branch_policies = true -> null
-           protected_branches     = false -> null
        }
    }

  # module.scaleway_env.scaleway_container.api will be created
+   resource "scaleway_container" "api" {
+       cpu_limit             = 100
+       cron_status           = (known after apply)
+       deploy                = false
+       domain_name           = (known after apply)
+       environment_variables = (known after apply)
+       error_message         = (known after apply)
+       http_option           = "redirected"
+       id                    = (known after apply)
+       local_storage_limit   = (known after apply)
+       max_concurrency       = (known after apply)
+       max_scale             = 1
+       memory_limit          = 128
+       min_scale             = 0
+       name                  = "toolbox-production-api"
+       namespace_id          = "*******************************************"
+       port                  = 4000
+       privacy               = "public"
+       protocol              = "http1"
+       region                = (known after apply)
+       registry_image        = "hub.docker.com/traefik/whoami:latest"
+       sandbox               = (known after apply)
+       status                = (known after apply)
+       timeout               = (known after apply)

+       health_check (known after apply)

+       scaling_option (known after apply)
    }

  # module.scaleway_env.scaleway_iam_policy.github_actions will be updated in-place
!~  resource "scaleway_iam_policy" "github_actions" {
        id              = "9fdb1d41-5b86-4d89-874c-c37c85384102"
        name            = "production-github-actions"
        tags            = []
#        (7 unchanged attributes hidden)

!~      rule {
!~          permission_set_names = [
+               "ContainersFullAccess",
#                (1 unchanged element hidden)
            ]
#            (3 unchanged attributes hidden)
        }
    }

Plan: 5 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #21](https://github.com/LancelotP/toolbox/actions/runs/15836849814)